trade_exp/src/InformationRegisters/СвязьВодителейТСПартнеров/СвязьВодителейТСПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="eb125a4a-2018-46b7-bc32-442bfc136d50">
  <name>СвязьВодителейТСПартнеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="67971b02-7a47-421b-a275-6486ff55e6af">
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="f1d4008a-5adb-4220-8220-39879b536bbf">
    <name>ПеревозчикКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="10a87189-b92d-4f84-9042-9221d5252c29">
    <name>ИдентификаторКурьераВМониторинге</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="72382cb3-5601-4e31-b2ac-07b13dbb0707">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="07d483ee-db9f-4414-ac7b-b63c09ab9521">
    <name>Автомобиль</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СвязьВодителейТСПартнеров/ManagerModule.bsl
Функция ПолучитьПараметрыЗаполненияПоВодителю(Водитель) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязьВодителейТСПартнеров.Водитель,
	|	СвязьВодителейТСПартнеров.Автомобиль,
	|	СвязьВодителейТСПартнеров.ПеревозчикПартнер,
	|	СвязьВодителейТСПартнеров.ПеревозчикКонтрагент КАК Перевозчик
	|ИЗ
	|	РегистрСведений.СвязьВодителейТСПартнеров КАК СвязьВодителейТСПартнеров
	|ГДЕ
	|	СвязьВодителейТСПартнеров.Водитель = &Водитель";
	
	Запрос.УстановитьПараметр("Водитель", Водитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьВодителя(Партнер, Контрагент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязьВодителейТСПартнеров.Водитель КАК Водитель,
	|	СвязьВодителейТСПартнеров.Автомобиль КАК Автомобиль,
	|	СвязьВодителейТСПартнеров.ПеревозчикПартнер КАК ПеревозчикПартнер,
	|	СвязьВодителейТСПартнеров.ПеревозчикКонтрагент КАК Перевозчик
	|ИЗ
	|	РегистрСведений.СвязьВодителейТСПартнеров КАК СвязьВодителейТСПартнеров
	|ГДЕ
	|	СвязьВодителейТСПартнеров.ПеревозчикПартнер = &Партнер
	|	И СвязьВодителейТСПартнеров.ПеревозчикКонтрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Водитель;
	Иначе
		Возврат Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
КонецФункции
